tap "homebrew/services"

# Core tools
brew "git"
brew "gh"
brew "nvm"
brew "yarn"
brew "go"

# Media
brew "ffmpeg"
brew "imagemagick"
brew "pandoc"

# Database
brew "mysql-client"
brew "mysql@8.4"

# Network
brew "cloudflared"
brew "nginx"

# Other
brew "ruby-build"
brew "ta-lib"

# Apps
cask "iterm2"
cask "warp"
cask "another-redis-desktop-manager"
